import re

badwords = [
    'ㅅㅂ', 'ㅂㅅ', 'ㅄ', 'ㅗ', 'ㅁㅊ', 'ㅈㄹ', 'ㅉㅉ', 'ㅆㅂ', 'ㅅㅂㄹㅁ', 'ㄲㅈ', 'ㄳㄲ', 'ㅅㄲ', 'ㅂㅅㄲ', 
    '개새끼', '썅', '씨발', '좆', '존나', 'ㅈㄴ', '개년', '염병', 'ㅄ새끼', 'ㅅㅂㄴ', 'ㅗㅗ', 'ㅂㅂㄹ', '좃', 
    'ㅈㄹㅁㄴ', 'ㅁㅊㄴ', 'ㅅㅅㄲ', 'ㅆㄹㄱ', 'ㄱㅅㄲ', 'ㅈㅅㄲ', 'ㅁㅊㄲ', 'ㅆㅅㄲ', 'ㅂㅅㄴ', 'ㅂㅅㅁㄴ', 
    'ㅅㅂㄹㅁㄴ', 'ㅂㅅㄹㅁ', 'ㅅㅂㄴㄱ', '병신', '미친놈', '미친년', '느금마', '느개비', '애미', '애비', 
    '엿먹어', '닥쳐', '꺼져', '죽어', '뒤져', '지랄', '지x', '시발', '씨바', '씨벌', '쉬발', '쉬벌',
    'ㅅ ㅂ', 'ㅆ ㅂ', 'ㅂ ㅅ', 'ㅈ ㄹ', 'ㅁ ㅊ', 'ㅈ ㄴ', 'ㅉ ㅉ', 'ㅗ ㅗ', 'ㄲ ㅈ', 'ㄳ ㄲ', 'ㄱ ㅅ ㄲ','느그매','창녀','고아','니엄마','앰창','엄창'
]


def censor_text(text):
    pattern = '|'.join([re.escape(word) for word in badwords]) 
    return re.sub(pattern, '***', text, flags=re.IGNORECASE)
